benchmark/benchmark.log

./wrk -t2 -c100 -d6s http://127.0.0.1:8080

## Node.js

Running 6s test @ http://127.0.0.1:8080
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.31ms    2.40ms  49.92ms   96.84%
    Req/Sec    16.17k     3.09k   19.96k    88.33%
  193050 requests in 6.01s, 20.44MB read
Requests/sec:  32124.17
Transfer/sec:      3.40MB

## asynchttpserver

Running 6s test @ http://127.0.0.1:8080
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.02ms    1.46ms  55.82ms   97.75%
    Req/Sec    25.73k     2.53k   29.94k    70.83%
  307329 requests in 6.01s, 11.14MB read
Requests/sec:  51127.58
Transfer/sec:      1.85MB

## netkit

Running 6s test @ http://127.0.0.1:8080
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.13ms    0.98ms  52.87ms   99.01%
    Req/Sec    23.71k     1.23k   26.33k    70.00%
  283005 requests in 6.00s, 13.49MB read
  Socket errors: connect 0, read 23, write 0, timeout 0
Requests/sec:  47147.53
Transfer/sec:      2.25MB

## readHttpHeader

asynchttpserver

Time taken: 4.538299999999997e-05
Time taken: 2.420800000000017e-05
Time taken: 2.505900000000002e-05
Time taken: 2.519799999999993e-05
Time taken: 2.856899999999999e-05
Time taken: 2.730300000000001e-05
Time taken: 4.221999999999993e-05
Time taken: 4.88559999999999e-05
Time taken: 2.362099999999971e-05
Time taken: 7.036800000000034e-05
Time taken: 2.327399999999978e-05
Time taken: 2.6056e-05
Time taken: 2.559600000000013e-05
Time taken: 2.324800000000002e-05
Time taken: 3.010899999999995e-05
Time taken: 2.435800000000037e-05
Time taken: 2.420800000000039e-05
Time taken: 3.801299999999994e-05
Time taken: 3.71929999999996e-05
Time taken: 4.056399999999988e-05


netkit 

Time taken: 2.335499999999997e-05
Time taken: 1.975499999999999e-05
Time taken: 2.296799999999995e-05
Time taken: 2.001100000000012e-05
Time taken: 2.381399999999982e-05
Time taken: 2.089200000000022e-05
Time taken: 2.09250000000002e-05
Time taken: 1.964700000000024e-05
Time taken: 6.81010000000001e-05
Time taken: 2.027699999999997e-05
Time taken: 1.951899999999996e-05
Time taken: 2.020800000000029e-05
Time taken: 2.086399999999978e-05
Time taken: 1.987199999999977e-05
Time taken: 2.439699999999979e-05
Time taken: 1.990200000000046e-05
Time taken: 2.3309e-05
Time taken: 1.98580000000002e-05
Time taken: 2.023800000000055e-05
Time taken: 3.185999999999987e-05

## readBody

asynchttpserver

Time taken: 4.636000000000028e-06
Time taken: 2.405000000000029e-06
Time taken: 2.618999999999929e-06
Time taken: 2.496999999999959e-06
Time taken: 2.685000000000101e-06
Time taken: 2.491000000000082e-06
Time taken: 2.494000000000021e-06
Time taken: 3.031000000000127e-06
Time taken: 2.541999999999909e-06
Time taken: 2.681999999999945e-06
Time taken: 2.44800000000038e-06
Time taken: 2.52100000000012e-06
Time taken: 2.691999999999885e-06
Time taken: 3.973999999999905e-06
Time taken: 4.06300000000033e-06
Time taken: 2.773000000000185e-06
Time taken: 2.603000000000327e-06
Time taken: 2.978000000000702e-06
Time taken: 2.65300000000003e-06
Time taken: 2.555000000000439e-06

netkit

Time taken: 8.12600000000001e-06
Time taken: 4.325000000000119e-06
Time taken: 4.597000000000065e-06
Time taken: 5.652000000000088e-06
Time taken: 4.450000000000027e-06
Time taken: 4.16800000000014e-06
Time taken: 5.550999999999907e-06
Time taken: 4.511000000000012e-06
Time taken: 5.082999999999911e-06
Time taken: 4.174000000000018e-06
Time taken: 4.002000000000346e-06
Time taken: 4.542000000000174e-06
Time taken: 4.31700000000021e-06
Time taken: 4.094999999999967e-06
Time taken: 4.264000000000351e-06
Time taken: 5.71099999999939e-06
Time taken: 4.495000000000193e-06
Time taken: 4.221000000000433e-06
Time taken: 4.472000000000156e-06
Time taken: 4.030000000000353e-06